---
type: PrintSetup
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# PrintSetup

`Autodesk.Revit.DB.PrintSetup` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Delete | — | `public bool Delete ()` |
| Method | Rename | — | `public bool Rename ( string newName )` |
| Method | Revert | — | `public void Revert ()` |
| Method | Save | — | `public bool Save ()` |
| Method | SaveAs | — | `public bool SaveAs ( string newName )` |
| Property | CurrentPrintSetting | — | `public IPrintSetting CurrentPrintSetting { get ; set ; }` |
| Property | InSession | — | `public InSessionPrintSetting InSession { get ; }` |